### Forest calibnet Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
module.calibnet.data.digitalocean_ssh_keys.keys: Reading...
module.calibnet.data.digitalocean_project.forest_project: Reading...
module.calibnet.data.digitalocean_ssh_keys.keys: Read complete after 1s [id=ssh_keys/12886492327922169494]
module.calibnet.digitalocean_droplet.forest: Refreshing state... [id=354655154]
module.calibnet.digitalocean_droplet.forest_observability: Refreshing state... [id=354655153]
module.calibnet.local_file.inventory: Refreshing state... [id=79470fcad21713d3cfb454188e49bc7e47c07bf6]
module.calibnet.digitalocean_firewall.forest_observability_firewall: Refreshing state... [id=4aa7898b-30d2-4864-b1ba-8a2b9778674a]
module.calibnet.digitalocean_firewall.forest_firewall: Refreshing state... [id=fdaa8ced-5c83-49da-b685-1c2c94dcd600]
module.calibnet.data.digitalocean_project.forest_project: Read complete after 2s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.calibnet.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.calibnet.local_file.inventory will be created
  + resource "local_file" "inventory" {
      + content              = <<-EOT
            [forest]
            165.22.95.22
            [observability]
            165.22.66.182
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../ansible/hosts_calibnet"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>